// 定义命名空间
var GameClient = GameClient || {};

// DFA 实现敏感词过滤 // improve from http://blog.sina.com.cn/s/blog_53f6148101016wq1.html
GameClient.FilterWord = cc.Class.extend({
    m_wordList: null, // @private
    m_map: null, // @private

    ctor: function (wordList) {
        if (wordList == null) {
            wordList = [];
        }
//        cc.warn("wordList: %o", wordList);
        this.m_wordList = wordList;
        this.m_map = this.BuildMap(wordList);
    },

    // 替换 str 中的敏感词为 replaceStr, step 为筛选强度， 最小为 0，最大为 5
    RunFilterWord: function (str, replaceStr, step) {
        if (str == undefined) {
            return "";
        }

        if (step > 5) {
            step = 5;
        }
        else if (step < 0) {
            step = 0;
        }

        for (var j = 0; j < step; j++) {
            var result = this.Check(this.m_map, str);
            var len = result.length;


            if (len == 0) {
                break;
            }
            // 排序结果，长度长的在前面
            result.sort(function (a, b) {
                return b.length - a.length});
//            console.log("result: " + result);
            for (var i = 0; i < len; i++) {
                str = str.replace(result[i], replaceStr);
            }
        }

        return str;
    },

    // @private
    BuildMap: function (wordList) {
        var result = {};
        var count = wordList.length;
        // 遍历单词
        for (var i = 0; i < count; ++i) {
            var map = result;
            var word = wordList[i];
            var wordLength = word.length;
            // 遍历单词的每个字母
            for (var j = 0; j < wordLength; ++j) {
                var ch = word.charAt(j);
                var stateInfo = map[ch];

                if (stateInfo == null) {
                    stateInfo = {};
                    map[ch] = stateInfo;
                }
                // 如果是最后一个字母，设置一个完结标识
                if (j == wordLength - 1) {
                    stateInfo["isFinish"] = true;
                }
                else {
                    map = stateInfo;
                }
            }
        }

        return result;
    },

    // @private // 找出 content 中的敏感词，会返回一个包含敏感词的列表
    Check: function (map, content) {
        var result = [];
        var count = content.length;
        var stack = [];
        var point = map;
        // 用于标记找到关键词的标记
        var isFound = false;
        var foundStack = null;

        for (var i = 0; i < count; ++i) {
            var ch = content.charAt(i);
            var item = point[ch];
            // 如果没找到则复位，让主循环
            if (item == null) {
                if (isFound) {
                    isFound = false;
                    i = i - (stack.length - foundStack.length + 1); // 计算回退距离
                    result.push(foundStack.join("")); // 把单个的字母数组连成一串字符串
                }
                else {
                    i = i - stack.length; // 计算回退距离
                }
                stack = []; // 清空字符堆栈
                point = map;
            }
            else if (item["isFinish"]) {
                stack.push(ch);
                point = item;
                // 标记找到了目标词
                isFound = true;
                foundStack = stack.concat(); // 复制数组
            }
            else {
                stack.push(ch);
                point = item;
            }
        }
        // 这里还要补充检查
        if (isFound) {
            result.push(foundStack.join("")); // 把单个的字母数组连成一串字符串
        }
        return result;
    },

    Destroy: function () {
        this.m_wordList = null;
        this.m_map = null;
    }
});

var sensitive_words = [
    '周恩来', '朱德', '林彪', '陈毅', '金三胖', '蓝鲸游戏', '聂荣臻', '罗荣桓', '李大钊', '孙中山', '孙逸仙', '陈云', '李鹏', '李瑞环', '李岚清', '罗干', '吴邦国', '贾庆林', '吴官正', '吴仪', '曾培炎', '曹刚川', '华建敏', '陈良宇', '张立昌', '俞正声', '王岐山', '王乐泉', '王刚', '刘淇', '郭伯雄', '王乐泉', '周永康', '连战', '宋楚瑜', '郁慕明', '蒋中正', '马英九', '李克强', '无帮国', '无帮过', '假庆林', '假青林', '习远平', '李磕墙', '和锅枪', '轴永康', '周健康', '周小康', '国务委员', '中央委员', '国家发展和改革委员会', '国家发展与改革委员会', '薄熙来', '温家饱', '温假饱', '胡惊涛', '华国锋', '新闻出版总署', '新闻出版署', '广电总局', '新闻出版广电总局', '希拉里', '布什', '小泉', '萨马兰奇', '阿拉法特', '默克尔', '里根', '林肯', '赫鲁晓夫', '斯大林', '恩格斯', '金日成', '胡志明', '希拉克', '阿罗约', '卡斯特罗', '华盛顿', '拿破仑', '路易', '劳拉', '奥巴马', '奥马尔', '达赖喇嘛', '张春桥', '王洪文', '希特勒', '冈村秀树', '高丽朴', '王丹', '李洪志', '赖昌星', '班禅', '山本五十六', '阿扁万岁', '热比娅', '实际神', '安倍晋三', '金正恩', '张学良', '监狱', '血溅南海', '南海', '血战南海', '法图麦', '赫蒂彻', '南海仲裁', '港独分子', '港独', '港灿狗', '总菊', '蔡英文', '卍', '东土耳其斯坦', '五四运动', '意志不坚的图腾', '默罕默德', '占中', '占领中环', '伊斯兰国', '灵灵教', '主神教', '三班仆人派', '灵仙真佛宗', '天父的儿女', '天父的儿子', '世界以利亚福音宣教会', '中华大陆行政执事站', '实际神', '全范围教会', '新约教会', 'Free tibet', '西藏自由', '南疆', '北疆', '新疆砍人', '东伊运', '恐怖组织', '买毒品', '卖毒品', '钓鱼岛', '钓鱼岛不属于中国', 'isil', 'isis', 'ISIS', 'gongchandang', '新疆7.5事件', '党中央', '新闻管制', '一边一国', '两国论', '分裂中国', '革命', '茉莉花', '突尼斯', '国内动态详情', '回回', '六四运动', '密宗', '民进党', '民主', '摩门教', '南华早报', '明慧网', '亲民党', '人民报', '法轮大法', '台独万岁', '示威', '台独分子', '台湾民国', '台湾国', '太子党', '天安门', '天安门运动', '小泉', '新疆独立', '新疆国', '西藏独立', '西藏国', '藏青会', '学潮', '一党专政', '两个中国', '游行', '真善忍', '政变', '政治反对派', '中共', '反党', '政府', '中国之春', '自焚', '共匪', '基地组织', '东亚病夫', '高治联', '专政', '世界维吾尔大会', '核武器', '原子弹', '导弹', '大参考', '国内动态清样', '天父的女儿', '活佛', '释迦牟尼', '阿弥陀佛', '河殇', '穆罕默德', '耶和华', '伊斯兰', '白莲教', '基督教', '大法', '法轮功', '真理教', '转法轮', '走向圆满', '跳大神', '神婆', '大卫教', '黑白无常', '藏独', '疆独', '台独', '台联', '西藏独立', '南蛮', '回族吃猪', '回族吃猪肉', '回民', '回民吃猪肉', '回民是猪', '回民都是猪', '臭尼姑', 'k粉', '古柯碱', '杀人', '贩毒', '拐卖', '卖淫', '强奸', '抢劫', '押大', '押注', '抽头', '赌马', '筹码', '轮盘赌', '大麻', '海洛因', '摇头丸', '鸦片', '迷幻药', '嗑药', '冰毒', '冰粉', '红5', '露点', '撸点', '乳贴', '萌娘', '小三', '小3', '软妹', '伪娘', '萝太', '伪男', '萌大奶', '傻毕', '啪啪啪', '卧槽', '你奶奶的', '你祖宗', '二奶', '偷窥图片', '成人影片', 'AV电影下载', 'av下载', '夫妻床上激情自拍', '处女', '押大', '押小', '坐台', '猥亵', '猥琐', '肉欲', '肉体', '排泄', '卵子', '搞基', '约炮', '撸管子', '处男', '黄盘', '黄网', '毛盘', '艾滋病', '性病', '叫春', '牛比', '小姐兼职', '毛片', '交配', '房事', '性事', '马拉戈壁', 'aids', 'DICK', 'Dick', 'sex', '屙', '淋病', '爱液', '逼', '臭鸡巴', '吹箫', '催情', '屌', '肛门', '黄色', '机巴', '鸡巴', '机巴', '鸡鸡', '鸡奸', '奸', '精液', '尻', '滥交', '轮奸', '屁眼', '强奸', '情色', '乳房', '乳交', '乳晕', '色情', '手淫', '威而柔', '性高潮', '性虐', '穴', '阳物', '阴部', '阴道', '阴核', '阴茎', '淫', '淫乱', '淫娃', '淫汁', '淫洞', '做爱', '阳痿', '奸淫', '性交', 'bt', 'FUCK', 'fuck', 'NMD', 'sb', 'SHIT', 'Suck', 'TMD', 'K他命', '笨蛋', '变态', '操她妈', '操你', '操他妈', '肏', '侧那', '插', '荡妇', '废物', '干妳', '干你', '干你妈B', '干你妈逼', '干他妈', '滚', '贱货', '烂人', '老土', '妈的', '妳老母的', '你妈逼', '仆街', '去妳的', '去你的', '去死', '日', '赛她娘', '赛你娘', '骚货', '傻比', '上妳', '神经病', '屎妳娘', '他妈的', '我操', '乡巴佬', '屙', '尿', '屌', '骑你', '操你', '操她', '骑他', '欠骑', '来爽我', '干你', '干她', '干爆', 'FUCK', '臭鸡', '烂鸟', '阳具', '肉壶', '摸咪咪', '干入', '强奸', '插你', '爽你', '干X', '他干', '干牠', '干汝', '操林', '操尼', '干勒', '干到', '干爽', '狗干', '来干', '轮流干', '援交', '我操', '鸡奸', '再奸', '奸你', '奸他', '奸一奸', '淫湿', '仆街', '尻', '烂逼', '叼你妈', '草你', '日你', '奸你', '逼你老母', '我日你', '卖逼', '奸淫', '奶子', '奶娘', '她娘', '你妈了妹', '插你妈', '渣波波', 'weelaa', '帝顺', '系统消息', '看下', '法克鱿', '潜烈蟹', '尾申鲸', '搞栗棒', '达菲鸡', 'ML', '群P', '双飞', '李克強', '台灣帝國', '回民吃猪', '碡 ', '朱駿 ', '朱容基', '朱熔基', '邾', '猪聋畸', '猪毛1', '瘃', '翥', '颛', '隹', '卓伯源', '斫', '髭', '子宫', '訾', '自民党', '自已的故事', '总理', '诹', '鄹', '躜', '作爱', '阼', '做爱', '阿萊娜', '埃裏克蘇特勤', '艾麗絲', '愛滋病', '暗黑法師', '奧克拉', '奧利弗', '奧倫', '㈧', '巴倫坦', '白夢', '班禪', '保釣', '鮑彤', '暴風亡靈', '暴熱的戰士', '暴躁的警衛兵靈魂', '北大三角地論壇', '北京當局', '貝尤爾', '逼樣', '蹕', '鑣', '婊子養的 ', '冰後', '不滅帝王', '布萊爾', '蔡崇國', '黲', '操那嗎B', '操那嗎比', '操你爺爺', '曹剛川', '草你媽', '册那娘餓比', '插那嗎逼', '插你媽', '覘', '囅', '長官沙塔特', '朝鮮', '車侖女幹', '陳炳基', '陳定南', '陳景俊', '陳軍', '陳蒙', '陳水扁', '陳希同', '陳宣良', '陳一諮', '諶', '櫬', '程凱', '鴟', '痴拈', '持不同政見 ', '赤色戰士', '傳染性病', '春夏自由論壇', '戳那嗎逼', '輳', '錯B', '錯比', '錯那嗎逼', '達夫警衛兵', '達癩', '大參考', '大東亞共榮', '大紀元', '大紀園', '大奶媽', '大史紀', '大中國論壇', '大衆真人真事', '戴維教', '彈劾', '蕩婦', '盜竊犯', '登輝', '糴', '覿', '帝國主義', '叼你媽', '丁關根', '東部地下水路', '東方時空', '東社', '東條', '東條英機', '東突獨立', '東西南北論壇', '東院看守', '鬥士哈夫拉蘇', '獨裁', '獨夫', '俄國 ', '發楞', '發掄功', '發倫功', '發論', '發論功', '發正念', '法~淪', '法~輪', '法爾卡', '法掄功', '法淪', '法輪大法', '法十輪十功', '法謫功', '反封鎖技術', '反人類', '方勵之', '放蕩', '廢墟守護者', '費良勇', '粉飾太平', '鱝', '風雨神州', '封從德', '封印的靈魂騎士', '馮素英', '襆', '嘸 ', '幹bi', '幹比', '幹幹幹', '幹你', '幹你老母', '幹全家', '幹死你', '幹一家', '岡巒', '剛比樣子', '肛門', '高文謙', '高自聯', '戈瑞爾德', '鴿派', '格雷', '格魯', '工自聯', '共産', '共産主義', '共軍', '緱', '狗狼養的', '狗養', '覯', '古龍祭壇', '鯝', '詿', '貫通兩極法', '嬀', '龜公', '龜頭', '劌', '滾那嗎', '滾那嗎錯比', '滾那嗎瘟比', '咼', '郭羅基', '國家安全', '國軍', '哈爾羅尼', '韓東方', '韓正', '顥', '河殤', '賀龍', '黑手黨', '紅色恐怖', '洪傳', '洪哲勝', '鱟', '胡錦滔', '胡景濤', '胡總書記', '湖岸警衛兵', '護法', '華建敏', '華夏文摘', '華岳時事論壇', '鍰', '黃伯源', '黃禍', '黃金幼龍', '黃片', '黃義交', '回民暴動', '繢', '毀滅騎士', '昏迷圖騰', '鍃', '活動 ', '擊傷的圖騰', '鶏八', '鶏吧', '鶏奸', '鶏女', '姬勝德', '賫', '賈廷安', '戔', '監視塔哨兵', '鰹', '簡肇棟', '賤B', '賤逼', '賤貨', '賤種', '江羅', '江戲子', '江澤慧', '江賊民', '將則民', '僵賊民', '蔣介石', '降低命中的圖騰', '撟', '矯健的馬努爾', '教養院', '揭批書', '她媽', '金槍不倒 ', '金澤辰', '錦濤', '經血', '荊棘護衛兵 ', '舊斗篷哨兵', '巨槌騎兵', '鋸齒通道被遺弃的骷髏', '屨', '絕望之地', '軍妓', '開放雜志', '凱爾本', '凱特切爾', '看中國', '靠你媽', '柯建銘', '克萊恩', '克勞森', '緙', '空虛的伊坤', '恐怖主義', '嚳', '貺', '拉姆斯菲爾德', '萊特', '蘭迪', '爛逼', '爛袋', '濫B', '濫比', '濫交', '勞改', '鰳', '誄', '李洪寬', '李蘭菊', '李錄', '李慶安', '李淑嫻', '李旺陽', '李月月鳥', '李總理', '裏菲斯', '轢', '奩', '連惠心', '連勝文', '聯總', '煉功', '兩岸三地論壇', '兩會', '兩會新聞', '廖錫龍 ', '林長盛', '林信義', '林重謨', '淩鋒', '劉賓雁', '劉國凱', '劉俊國', '劉千石', '劉山青', '劉文勝', '劉曉波', '劉永川', '龍虎豹', '盧卡', '陸委會', '呂京花', '亂交', '亂輪', '掄功', '輪大', '輪奸', '羅福助', '羅禮詩', '羅志明', '濼', '媽B', '媽的', '馬大維', '馬良駿', '馬時敏', '馬英九', '瑪麗亞', '嗎的', '勱', '賣逼', '賣國', '賣淫', '毛厠洞', '毛賊東', '美國參考', '美國之音', '蒙古達子', '蒙古獨立', '羋', '黽', '民進黨', '民意論壇', '民主墻', '湣', '摸你鶏巴', '木子論壇', '內衣', '那嗎逼', '那嗎老比', '那娘錯比', '奶頭', '南蠻子', '能樣', '倪育賢', '你媽', '你媽比', '你媽了妹', '你爺 ', '捏你鶏巴', '儂著卵拋', '女幹', '儺', '潘國平', '蹣 ', '泡沫經濟', '噴你', '羆', '潑婦 ', '齊諾', '磧', '鈐', '錢國梁', '膁', '錆', '喬石', '橋侵襲兵', '鞽', '親美', '親日', '禽獸', '輕舟快訊', '情獸', '慶紅', '詘', '闃', '全國人大', '綣', '愨', '熱比婭', '人民報', '人民內情真相', '人民之聲論壇', '日本帝國', '日內瓦金融', '日你爺爺', '顬', '乳暈', '薩達姆', '三個代表', '三去車侖工力', '糝', '騷棒', '騷逼', '騷貨', '騷卵 ', '殺你一家', '傻鳥', '山口組', '上訪', '上海孤兒院', '社會主義', '灄', '神經病', '生孩子沒屁眼', '澠', '聖戰', '濕了還說不要', '釃', '石化圖騰', '時代論壇', '鰣', '史萊姆王', '世界經濟導報', '侍從貝赫爾特', '貰', '數據中國', '氵去車侖工力', '稅力', '司馬璐', '私?服', '思科羅', '斯皮爾德', '四川獨立', '宋書元', '蘇菲爾', '蘇南成', '蘇特勒守護兵', '蘇特勤護衛兵', '蘇曉康', '蘇貞昌', '碎片製造商人馬克', '孫大千', '他媽', '他嗎的', '塔內', '鰨', '臺盟', '臺灣獨立', '臺灣共産黨', '臺灣建國運動組織', '臺灣青年獨立聯盟', '臺灣自由聯盟', '太監', '泰奴橋掠奪者', '唐柏橋', '謄', '天安門錄影帶', '天安門屠殺', '天閹', '齠', '銚', '統獨', '統戰', '頭領墳墓管理員', '屠殺', '團員馬爾汀', '鼉', '膃', '外交與方略', '綰', '萬潤南', '萬曉東', '王超華', '王剛', '王滬寧', '王樂泉', '王世堅', '王秀麗', '網禪', '猥褻', '溫B', '溫比', '溫元凱', '無界瀏覽器', '吳敦義', '吳弘達', '吳仁華', '吳學燦', '吳育升', '西藏獨', '吸血獸', '洗腦', '系統公告', '郤', '下體', '躚', '獫', '峴', '現金交易', '鯗', '項小吉', '小B樣', '小參考', '小靈通', '謝長廷', '謝選駿', '辛灝年', '新華舉報', '新華通論壇', '新生網', '新聞出版總署', '新義安', '信用危機', '性愛', '修煉', '虛弱圖騰', '徐國舅', '許家屯', '諼', '學潮', '學運', '澩', '訁', '嚴家祺', '顔清標', '顔射', '央視內部晚會', '陽痿', '楊懷安', '楊巍', '楊周', '姚月謙', '搖頭丸', '藥水', '野鶏', '夜話紫禁城', '伊莎貝爾', '伊斯蘭亞格林尼斯', '議長阿茵斯塔', '异見人士', '异議人士', '意志不堅的圖騰', '陰部', '陰道', '陰戶', '陰精', '陰門', '陰水', '淫穢', '淫賤', '引導', '鷹眼派氏族', '憂鬱的艾拉', '由喜貴', '游蕩的士兵', '游錫坤', '友好的魯德', '幼龍', '余英時', '輿論', '傴', '齬', '鵒', '圓滿', '遠志明', '韞', '鏨', '則民', '澤夫', '賾', '譖', '驏', '張博雅', '張健', '張清芳', '張溫鷹', '張志清', '帳號', '招鶏', '趙建銘', '趙品潞', '趙紫陽', '鎮壓', '正見網', '㊣', '鄭麗文', '鄭餘鎮', '鄭運鵬', '政治反對派', '躑', '騭', '躓', '中毒圖騰', '中國復興論壇', '中國孤兒院', '中國論壇', '中國社會論壇', '中國問題論壇', '中國真實內容', '中國猪', '中華大衆', '中華民國', '中華人民正邪', '中華養生益智功', '中央電視臺', '周鋒鎖', '周守訓 ', '朱立倫', '㈱', '主攻指揮官', '助手威爾特', '顓', '諑', '鯔', '自民黨', '總理', '鯫 ', '纘', '做愛', '胡总书记', '胡景涛', '大纪元', '燕玲论坛', '共产党', '我操', '他妈的', '鸡巴', '傻B', '江泽民', '温家宝', 'rivals', 'UR', '性交', '婊子', '她妈', '牛B', '煞笔', '傻B', '装逼', '日你妈', '删号', '删 号', '妈逼', 'T.M.D', 'jb', '出售此号', 'U/R', 'j8', '8仙', '出售神符', '黄色', '台独', '鸡巴', 'NPC', '*李*洪*志*阿扁', '阿拉', '挨球', '安全局', '八九', '办理文凭', '包皮', '保监会', '鸨', '暴动', '暴徒', '贝肉', '本?拉登', '笨屄', '屄', '逼毛', '逼样', '婊', '宾周', '波霸', '薄一波', '布雷尔', '布什', '参事室', '藏独', '操', '操Gm', '操gm', '操逼', '操蛋', '交媾', 'K粉', '小姐兼职', '西藏314事件', '乱伦', '黄片', '群交', '茉莉花革命', '操你妈', '操他', '草的你妈', '草你妈', '肏', '插GM', '插gM', '插妳', '插你妈', '产权局', '车臣', '陈功', '陈水扁', '陈晓宁', '陈至立', '成人片', '吃屎', '赤匪', '抽你丫的', '出售假币', '出售手枪', '吹箫', '蠢猪', '粗制吗啡', '达赖', '打炮', '大逼', '大波波', '大麻树脂', '大师', '大学骚乱', '大血比', '戴海静', '戴晶', '党主席', '档案局', '盗窃犯', '邓小平', '电监会', '叼你妈', '屌7', '屌毛', '屌七', '钓鱼台', '丁子霖', '东升', '东突', '东突组织', '董建华', '董文华', '独立', '恩格斯', '二屄', '二乙基酰胺发抡', '发伦', '发轮', '发论公', '发骚', '法*轮*功', '法愣', '法轮', '法轮功', '法制办', '反革命', '冰粉', '反共', '反恐委员会', '反政府', '佛教', '佛祖', '阝月', '傅作义', '干Gm', '干gm', '干妳', '干妳妈', '干你', '干你妈b', '干你娘', '干死你', '肛交', '港澳办', '高丽棒子', '高校群体事件', '睾', '膏药旗', '公安', '公安局', '共产主义', '共狗', '狗操', '狗娘', '狗日', '狗屎', '官逼民反', '龟儿子', '龟孙子', '鬼村', '郭伯雄', '国防部', '国管局', '国家民委', '国家主要部委', '国民党万岁', '海洋局', '贺国强', '黑社会', '黑手党', '红卫兵', '洪志', '胡XX', '胡紧掏', '胡锦涛', '胡乔木', '胡主席', '华国锋', '换妻', '黄菊', '黄色小电影', '回良玉', '回族人吃猪肉', '火棒', '机巴', '鸡巴', '鸡芭', '鸡奸', '基督', '激情电影', '鸡', '计生委', '妓女', '贾庆林', '奸夫淫妇', '奸淫', '贱逼', '贱人', '江八', '江独裁', '江青', '江择民', '江贼民', '江猪', '江主席', '疆独', '蒋经国', '酱猪媳', '姣西', '叫鸡', '教育部', '金正日', '经济社会理事会', '精液', '警匪一家', '靖国神社', '纠察员', '鸠屎', '军国主义', '尻', '靠你妈', '可待因', '可卡因', '恐怖份子', '口交', '狂操', '拉登', '懒教', '烂屄', '烂比', '烂货', '劳动保障部', '老毛子', '黎阳评', '李登辉', '李红志', '李宏志', '李岚清', '李鹏*', '李山', '李先念', '联大', '联合国大会', '联易互动', '两腿之间', '林彪', '刘\u3000淇', '刘淇', '刘云山', '六.四', '六?四', '六四', '六四事件', '龙新民', '旅游局', '轮功', '罗\u3000干', '骡干', '妈比', '妈批', '妈B', '麻醉钢枪', '麻醉药', '马克思', '马英九', '吗啡碱', '买财富', '麦角酸', '卖B', '卖QQ', '卖比', '卖党求荣', '卖国求荣', '卖卡', '卖淫', '毛厕洞', '毛泽东', '毛主席', '美国', '美国之音', '蒙尘药', '蒙古达子', '迷魂药', '迷歼药', '密洞', '民航局', '民运', '明慧网', '莫索里尼', '穆斯林', '奶子', '妳妈的', '妳娘的', '南蛮子', '嫩B', '伱妈', '你大爷', '你老母', '你姥', '你妈', '你妈的', '你爷爷的', '鸟Gm', '鸟gm', '牛逼', '农业部', '拍肩神药', '彭真', '屁眼', '苹果日报', '破鞋', '普京', '钱其琛', '枪决现场', '强奸', '强卫', '强硬发言', '乔石', '切七', '窃听器材', '青天白日', '去你妈的', '全国人大', '人大', '人代会', '人民', '人民广场', '人民银行', '日GM', '日gM', '日X妈', '日本鬼子', '日你妈', '日他娘', '肉壁', '肉缝', '肉棍子', '乳', '乳房', '乳头', '萨达姆', '塞你爸', '塞你老母', '塞你母', '三个呆婊', '三级片', '三陪', '三去车仑', '骚', '骚逼', '骚', '色情电影', '色情小电影', '傻B', '傻逼', '傻吊', '傻子', '商务部', '上你', '射精', '神经病', '生鸦片', '十八摸', '食捻屎', '驶你爸', '驶你老母', '驶你母', '是鸡', '受虐狂', '售号', '双峰微颤', '水利部', '税务总局', '私服', '私\\服', '私-服', '斯大林', '死GD', '死GM', '四川独立', '宋楚瑜', '孙文', '孙中山', '他妈', '他马的', '他祖宗', '台独', '台湾党', '台湾独立', '台湾共和国', '台湾国', '太监', '唐家璇', '田纪云', '投毒杀人', '推油', '外挂', '外\\挂', '外挂', '外—挂', '外交部', '晚年周恩来', '王八蛋', '王刚', '王乐泉', '王太华', '王震', '威而钢', '卫生部', '温加宝', '温家保', '温总理', '文物局', '倭寇', '我操你', '我妳老爸', '我日你', '吴\u3000仪', '吴官正', '五星红旗', '西藏天葬', '希特勒', '洗脑班', '系统公告', '鲜族', '想上你', '小泉', '小日本', '小乳头', '邪教', '兴奋剂', '性交', '性无能', '徐光春', '血逼', '鸦片', '鸦片渣', '严方军', '阳具', '摇头玩', '耶苏', '叶剑英', '一党专制', '一国两制', '一中一台', '伊朗', '以茎至洞', '阴部', '阴道', '阴核', '阴茎', '阴水', '淫', '淫秽', '淫贱', '淫毛', '淫水', '淫语连连', '英雄纪念碑', '邮政局', '游戏宫理员', '游行', '舆论钳制', '欲火焚身', '援交', '曰GM', '曰gM', '曰你', '月经不调', '扎卡维是英雄', '造反', '曾庆红', '张朝阳', '张德江', '张立昌', '赵紫阳', '真理教', '中华民国', '中宣部', '周永康', '朱德', '朱容基', '朱镕基', '猪操', '主席', '转法轮', '装逼', '子女任职名单', '自杀手册', '自制手枪', '宗教', '总理', '坐台的', '共产党', '胡锦涛', '严方军', '操逼毛', '骚货', '江泽民', '温家宝', 'rivals', 'ur', 'UR', '性交', 'U R', 'webgame.com.cn', '妓女', '她妈', '牛比', '煞笔', '傻B', '操你妈', '装B', '不玩了', '卖号', '烂游戏', '妈的', '草你妈', 'JB', '淘宝', '出售此号', 'U/R', 'c a o', '吗的', '狗日', '色情', 'h站', '虎门', 'WEB牌戰', '战牌', 'ＵＲ', 'UR', '藏独', '法轮大法', 'ur', 'urban', '坐台的', '总理', '自治机关', '毛泽东', '刘少奇', '彭德怀', '刘伯承', '贺龙', '徐向前', '叶剑英', '陈独秀', '孙文', '邓小平', '江泽民', '朱镕基', '尉健行', '胡锦涛', '温家宝', '曾庆红', '黄菊', '李长春', '回良玉', '周永康', '唐家璇', '陈至立', '张德江', '俞正声', '刘云山', '王兆国', '贺国强', '胡耀邦', '王兆国', '李登辉', '陈水扁', '吕秀莲', '蒋介石', '蒋经国', '习近平', '吴帮国', '无邦国', '瘟家宝', '甲庆林', '离长春', '袭近平', '贺过墙', '粥永康', '肘永康', '粥健康', '李源潮', '汪洋', '张高丽', '布什', '小泉', '纯一郎', '安南', '普京', '克林顿', '尼克松', '杜鲁门', '列宁', '马克思', '金正日', '萨达姆', '西哈努克', '撒切尔', '曼德拉', '富兰克林', '艾森豪威尔', '亚历山大', '拉姆斯菲尔德', '鲍威尔', '特朗普', '本拉登', '柴玲', '江青', '姚文元', '东条英机', '墨索里尼', '冈村宁次', '赵紫阳', '沃尔开西', '李大师', '马加爵', '额尔德尼', '阿扁', '热那亚', '六四', '美国之音', '民国', '民运', '民主潮', '纳粹', '南蛮', '起义', '瘸腿帮', '法轮功', '打倒共产党', '圣战', '台独', '台联', '台湾岛国', '台湾独立', '天安门事件', '屠杀', '新党', '新疆分裂', '疆独', '西藏分裂', '藏独', '藏妇会', '学运', '一中一台', '一贯道', '造反', '镇压', '政治', '政治犯', '共产党', '反共', '民主党', '转法轮', '共党', '苏家屯', '塔利班', '支那', '高自联', '专制', '核工业基地', '铀', '氢弹', '核潜艇', '小参考', '多维', '摩门教', '圣战', '耶稣', '真主安拉', '天主教', '东正教', '法轮', '瘸腿帮', '真善忍', '自焚', '黄大仙', '神汉', '真理教', '阎王', '牛头马面', '高丽棒子', '蒙古鞑子', '台独分子', '台湾民国', '新疆独立', '老毛子', '谋杀', '吸毒', '赌博', '走私', '造反', '轮奸', '先奸后杀', '下注', '坐庄', '赌球', '老虎机', '安非他命', '可卡因', '冰毒', '杜冷丁', '罂粟', '白粉', '吸毒', 'AIDS', 'Aids', 'dick', 'penis', 'SM', '爱滋', '梅毒', '屄', '臭机八', '吹喇叭', '催情药', '肛交', '龟头', '机八', '鸡八', '机掰', '鸡叭', '鸡掰', '妓女', '茎', '精子', '口交', '乱交', '卖淫', '嫖娼', '强奸犯', '肉棒', '乳峰', '乳头', '三陪', '射精', '威而钢', '伟哥', '性交', '性欲', '颜射', '一夜情', '阴唇', '阴蒂', '阴户', '阴门', '淫秽', '淫水', '淫液', '淫穴', '援交妹', '梦遗', '早泄', '性欲', 'Bitch', 'cao', 'Fuck', 'kao', 'NND', 'shit', 'SUCK', 'tmd', 'tnnd', '白痴', '屄', '婊子', '操妳妈', '操你妈', '草你', '册那', '测拿', '蠢猪', '发骚', '干她妈', '干妳娘', '干你妈', '干你妈b', '干你娘', '狗娘养的', '鸡奸', '贱人', '老母', '妈比', '马的', '妳娘的', '破鞋', '去她妈', '去妳妈', '去你妈', '去他妈', '日你', '赛妳娘', '赛他娘', '傻B', '傻子', '上你', '屎', '屎你娘', '王八蛋', '我日', '猪猡', '干', '掯', '操', '湿了', '操他', '骑你', '骑她', '欠人骑', '来插我', '干他', '干死', '干机', '机叭', '臭机', '览叫', '肉棒', '奶子', '干鸡', '小穴', '插你', '爽你', '干干', '我操', '干它', '干您', '干林', '干尼', '我咧干', '干我', '干啦', '欠干', '我干', '轮干', '干一干', '骑你', '轮奸', '奸暴', '我奸', '奸你', '奸她', '淫水', '鸡歪', '臭西', '遗精', '大血比', '靠你妈', '干你', '插你', '戳你', '挨球', '草拟妈', '狗操卖逼', '日死', '阴茎', '他娘', '骚B', '逼毛', '叼你', '嫩b', '缔顺', '蒂顺', '午夜', '草泥马', '雅蠛蝶', '菊花蚕', '吉跋猫', '吟稻雁', 'SM', '3P', '马勒戈壁', '周恩來', '碡', '籀', '朱駿', '朱狨基', '朱溶剂', '朱镕基', '猪操', '猪毛', '舳', '躅', '專政', '丬', '窀', '倬', '诼', '鲻', '秭', '自焚', '自慰', '自由民主论坛', '偬', '陬', '鲰', '缵', '作秀', '祚', '阿扁萬歲', '啊無卵', '埃斯萬', '愛滋', '垵', '嶴', '奧拉德', '奧魯奇', '奧特蘭', '巴倫侍從', '白立樸', '白皮書', '寶石商人', '鮑戈', '鮑伊', '暴亂', '暴躁的城塔野獸', '暴躁的馬杜克', '北韓', '北美自由論壇', '韝', '比樣', '颮', '婊子養的', '賓周', '博訊', '不爽不要錢', '布雷爾', '蔡啓芳', '操鶏', '操那嗎逼', '操你媽', '曹長青', '草', '草擬媽', '插那嗎B', '插那嗎比', '插你爺爺', '蕆', '閶', '常勁', '車侖', '沉睡圖騰', '陳博志', '陳建銘', '陳菊', '陳良宇', '陳破空', '陳唐山', '陳小同', '陳學聖', '陳總統', '齔', '讖', '程鐵軍', '痴鳩', '遲鈍的圖騰', '持不同政見', '赤色騎士', '處女膜', '吹簫', '戳那嗎B', '戳那嗎比', '鹺', '錯逼', '錯那嗎B', '錯那嗎比', '達夫侍從', '打飛機', '大東亞', '大鶏巴', '大紀元新聞網', '大家論壇', '大史記', '大衛教', '大中華論壇', '紿', '戴相龍', '氹', '導師', '德維爾', '鄧笑貧', '迪裏夏提', '地下教會', '電視流氓', '釣魚島', '東北獨立', '東方紅時空', '東南西北論談', '東升', '東條英機', '東突暴動', '東土耳其斯坦', '東亞', '動亂', '鬥士霍克', '獨裁政治', '獨立臺灣會', '俄國', '鮞', '㈡', '發掄', '發倫', '發輪', '發論公', '發騷', '法~倫', '法~綸', '法~論', '法掄', '法侖', '法綸', '法輪功', '法謫', '反封鎖', '反腐敗論壇', '反社會', '防衛指揮官', '飛揚論壇', '費鴻泰', '分隊長施蒂文', '糞便', '豐饒的果實', '風雨神州論壇', '封殺', '馮東海', '紱', '嘸', '傅作義', '幹逼', '幹的你', '幹她', '幹你老比', '幹你娘', '幹死', '幹他', '趕你娘', '剛比', '崗哨士兵', '高麗棒子', '高薪養廉', '膏藥旗', '戈揚', '歌功頌德', '格雷(關卡排名管理者)', '格魯(城鎮移動)', '鯁', '弓雖', '共産黨', '共黨', '共榮圈', '狗誠', '狗娘養的', '狗雜種', '轂', '骨獅', '鴰', '關卓中', '廣聞', '龜兒子', '龜孫子', '龜投', '緄', '滾那嗎B', '滾那嗎老比', '鯀', '郭俊銘', '郭岩華', '國家機密', '國賊', '頇', '韓聯潮', '漢奸', '灝', '賀國强', '黑社會', '紅燈區', '紅炎猛獸', '洪興', '黌', '胡緊掏', '胡錦淘', '胡喬木', '湖岸護衛兵', '湖岸哨兵隊長', '鸌', '華通時事論壇', '華語世界論壇', '懷特', '皇軍', '黃慈萍', '黃劍輝', '黃菊', '黃翔', '黃仲生', '噦', '毀滅步兵', '毀滅射手', '混亂的圖騰', '活動', '擊倒圖騰', '鶏8', '鶏巴', '鶏鶏', '鶏毛信文匯', '鶏院', '積克館', '鱭', '賈育台', '監視塔', '監視塔哨兵隊長', '韉', '建國黨', '賤bi', '賤比', '賤人', '江八點', '江綿恒', '江則民', '江賊', '薑春雲', '僵賊', '講法', '蔣中正', '醬猪媳', '狡猾的達夫', '嶠', '癤', '訐', '届中央政治局委員', '金槍不倒', '金堯如', '巹', '經文', '莖候佳陰', '荊棘護衛兵', '靖國神社', '㈨', '齟', '巨鐵角哈克', '鋸齒通道骷髏', '棬', '譎', '開苞', '凱奧勒尼什', '凱爾雷斯', '砍翻一條街', '闞', '柯賜海', '科萊爾', '克萊特', '客戶服務', '空氣精靈', '空虛之地', '瞘', '鄺錦文', '昆圖', '拉皮條', '賴士葆', '爛B', '爛比', '爛貨', '濫逼', '濫貨', '勞動教養所', '勞教', '雷尼亞', '李紅痔', '李繼耐', '李老師', '李祿', '李慶華', '李鐵映', '李小鵬', '李志綏', '李總統', '鱧', '躒', '連方瑀', '連勝德', '連戰', '廉政大論壇', '兩岸關係', '兩個中國', '兩會報道', '廖錫龍', '林保華', '林佳龍', '林正勝', '躪', '劉賓深', '劉剛', '劉華清', '劉凱中', '劉青', '劉士賢', '劉文雄', '劉曉竹', '㈥', '鷚', '龍火之心', '盧西德', '輅', '呂秀蓮', '亂倫', '鋝', '倫功', '輪功', '論壇管理員', '羅幹', '羅文嘉', '腡', '洛克菲爾特', '媽比', '媽批', '馬克思', '馬三家', '馬特斯', '馬永成', '瑪雅', '嗎啡', '麥克斯', '賣比', '賣騷', '瞞報', '毛賊', '美國', '美國佬', '蒙獨', '蒙古獨', '禰', '綿恒', '民國', '民聯', '民陣', '緡', '鰵', '莫偉强', '內褲', '那嗎B', '那嗎錯比', '那嗎瘟比', '納粹', '南大自由論壇', '鬧事', '尼奧夫', '鯢', '你媽逼', '你媽的', '你說我說論壇', '你爺', '娘餓比', '儂著岡巒', '奴隸魔族士兵', '女主人羅姬馬莉', '諾姆', '蹣', '龐建國', '轡', '皮條客', '諞', '潑婦', '齊墨', '騎你', '僉', '錢達', '錢其琛', '槧', '繰', '喬伊', '譙', '篋', '親民黨', '欽本立', '唚', '情婦', '檾', '丘垂貞', '去你媽的', '全國兩會', '犬', '瘸腿幫', '讓你操', '熱站政論網', '人民大會堂', '人民真實', '人權', '日軍', '日你媽', '日朱駿', '乳頭', '瑞士金融大學', '三K黨', '三級片', '㈢', '毿', '騷B', '騷包', '騷棍', '騷鶏', '騷卵', '殺你全家', '殺人犯', '煞筆', '善惡有報', '上海幫', '厙', '射了還說要', '詵', '諗', '生命分流的圖騰', '聖射手', '盛華仁', '濕了還說要', '鯴', '㈩', '石拳戰鬥兵', '時事論壇', '史萊姆', '士兵管理員瓦爾臣', '事實獨立', '侍從倫斯韋', '攄', '雙十節', '氵去車侖工力?', '司馬晋', '司徒華', '私處', '斯諾', '四川獨', '四人幫', '㈣', '藪', '蘇拉', '蘇紹智', '蘇特勤', '蘇特勤魔法師', '蘇盈貴', '誶', '碎片製造商人蘇克', '孫中山', '他媽的', '他母親', '塔烏', '闥', '臺灣帝國', '臺灣獨', '臺灣狗', '臺灣民國', '臺灣政論區', '鮐', '泰奴橋警衛兵', '湯光中', '鞀', '天安門', '天安門事件', '天安門一代', '田紀雲', '鰷', '庭院警衛兵', '統獨論壇', '頭領奧馬', '圖書管理員卡特', '團長戈登', '摶', '籜', '外交論壇', '晚年周恩來', '萬里', '萬維讀者論壇', '王寶森', '王輔臣', '王涵萬', '王軍濤', '王潤生', '王世勛', '王兆國', '網特', '鮪', '溫逼', '溫家寶', '閿', '吳百益', '吳方城', '吳宏達', '吳淑珍', '吳學璨', '吳志芳', '吸收的圖騰', '覡', '系統', '餼', '下賤', '薟', '鮮族', '蜆', '現金', '獻祭的圖騰', '項懷誠', '嘵', '小比樣', '小鶏鶏', '小泉純一郎', '謝深山', '謝中之', '新觀察論壇', '新華內情', '新疆獨', '新手訓練營', '新聞封鎖', '新語絲', '邢錚', '性無能', '頊', '虛無的飽食者', '許財利', '許信良', '薛偉', '學聯', '學自聯', '閹狗', '嚴家其', '閻明複', '顔慶章', '讞', '陽具', '陽物', '楊建利', '楊月清', '姚羅', '軺', '藥材商人蘇耐得', '耶穌', '葉菊蘭', '一陀糞', '㈠', '伊斯蘭', '遺精', '議員斯格文德', '异型叛軍', '易丹軒', '瘞', '陰唇', '陰蒂', '陰莖', '陰毛', '陰囊', '淫蕩', '淫貨', '尹慶民', '隱者之路', '硬直圖騰', '尤比亞', '游蕩的僵尸', '游蕩爪牙', '游戲管理員', '幼齒', '于幼軍', '漁夫菲斯曼', '輿論反制', '宇明網', '飫', '元老蘭提(沃德）', '緣圈圈', '月經', '雜種', '造愛', '擇民', '澤民', '賊民', '扎卡維是英雄', '張伯笠', '張鋼', '張林', '張偉國', '張昭富', '章孝嚴', '賬號', '趙海青', '趙南', '趙曉微', '貞操', '爭鳴論壇', '正義黨論壇', '鄭寶清', '鄭義', '鄭源', '政權', '縶', '指點江山論壇', '觶', '中毒的圖騰', '中俄邊界', '中國共産黨', '中國和平', '中國社會進步黨', '中國威脅論', '中國移動通信', '中國之春', '中華大地', '中華講清', '中華人民實話實說', '中華時事', '中華真實報道', '鐘山風雨論壇', '周守訓', '朱鳳芝', '朱溶劑', '猪聾畸', '主義', '專制', '轉化', '資本主義', '子宮', '自由民主論壇', '諏', '鯫', '躦', '作愛', 'fuck', 'urban', 'cao', 'TMD', '煞笔', '法轮功', '胡锦涛', 'urban-rivals', '我日', 'ur', '口交', '妓女', '牛逼', '牛比', '傻逼', '操你妈', '装B', '不玩了', '卖号  ', '妈的', '草你妈', 'JB', '出售账号', '卖号', 'U-R', '吗的', '狗日', '色情', '藏独', '法轮大法', '毛泽东', '*法*轮*功*', '*李*洪*志*', '阿扁万岁', '阿拉法特', '安南', '澳洲光明网', '八九风波', '办理证件', '保钓', '保密局', '鲍岳桥', '暴乱', '北京之春', '本?拉登', '苯比', '笨逼', '屄毛', '逼你老母', '比毛', '婊子', '冰毒', '博讯', '布莱尔', '布什', '财政部', '藏独', '藏独', '操GM', '操gM', '操XX', '操比', '操你', 'CAO', ' K粉', 'J8', ' 小姐兼职', '西藏314事件', ' 乱伦', '黄片', '群交', '茉莉花革命', '操你八辈祖宗', '操你妈屄', '曹刚川', '草妈', '草拟妈', '测绘局', '插Gm', '插gm', '插你', '插深些', '朝鲜', '车仑', '陈良宇', '陈希同', '陈毅', '成人电影', '吃大便', '迟浩田', '抽插', '臭化西', '出售枪支', '吹喇叭', '春药', '戳你', '催情药', '达赖喇嘛', '大B', '大便', '大麻', '大麻油', '戴维教', '大血B', '呆卵', '戴红', '戴维教', '荡妇', '盗窃犯', '道教', '帝国主义', '叼你', '屌', '屌鸠', '屌妳', '屌西', '丁关根', '东北独立', '东条英机', '东突暴动和独立', '东亚病夫', '董贱华', '懂文华', '独立台湾会', '二B', '二逼', '发抡功', '发伦功', '发论', '发论功', '法(轮)功', '法功', '法仑', '法轮大法', '法西斯', '反动', '发票', '性奴', '反华', '反日', '分裂祖国', '佛展千手法', '斧头镰刀', '傅鹏', '干GM', '干gM', '干拎娘', '干妳老母', '干妳娘', '干你妈', '干你妈逼', '干七八', '肛', '肛门', '高俊', '高校暴乱', '高校骚乱', '睾丸', '弓虽女干', '公安部', '共产党', '共匪', '狗b', '狗卵', '狗屁', '狗日的', '观世音', '官商勾结', '龟公', '龟头', '滚', '国安局', '国防科工委', '国际法院', '国家主席', '国民党', '海洛因', '何候华', '贺龙', '黑手党', '黑手党', '洪兴', '后庭', '胡紧涛', '胡紧套', '胡锦淘', '胡耀邦', '花柳', '华建敏', '黄\u3000菊', '黄色电影', '回教', '回民暴动', '昏药', '机八', '鸡八', '鸡叭', '鸡掰', '基地组织', '基督教', '激情小电影', '计牌软件', '妓', '妓院', '奸', '奸你', '贱', '贱货', '江Core', '江八点', '江核心', '江戏子', '江泽民', '江折民', '江猪媳', '僵贼民', '蒋介石', '蒋中正', '交通部', '叫床', '叫小姐', '她妈的金日成', '禁书', '经社理事会', '精子', '敬国神社', '静坐', '鸠', '军长发威', '军妓', '靠', '靠腰', '可卡叶', '克林顿', '恐怖主义', '寇晓伟', '狂操你全家', '拉姆斯菲尔德', '烂B', '烂逼', '烂屌', '劳+教+所', '老逼', '老母', '李长春', '李弘旨', '李宏旨', '李洪志', '李鹏', '李瑞环', '李铁映', '连战', '联合国', '联易', '粮食局', '列宁', '林业局', '刘军', '刘少奇', '流氓', '六。四', '六合彩', '六-四', '六四真相', '吕秀莲', '卵', '轮奸', '罗干', '妈逼', '妈卖妈屁', '妈祖', '妈的', '麻醉枪', '麻醉乙醚', '马卖马屁', '吗啡', '吗啡片', '买卖枪支', '卖.国', '卖ID', '卖逼', '卖财富', '卖国', '卖号', '卖软件', '毛XX', '毛一鲜', '毛贼东', '梅花网', '美国佬', '美利坚', '蒙独', '蒙古独立', '迷奸药', '迷药', '密宗', '民进党', '民政部', '摩门教', '穆罕默德', '乳头', '妳老母的', '妳马的', '南联盟', '南蛮子', '嫩b', '你爸', '你二大爷', '你老味', '你姥姥的', '你妈逼', '你娘', '鸟GM', '鸟gM', '鸟你', '牛比', '虐待', '喷你', '皮条', '嫖客', '破坏', '仆街', '气象局', '枪决女犯', '枪支弹药', '强奸犯', '强效失意药', '抢劫', '侨办', '窃听器', '亲民党', '情色', '去死', '瘸腿帮', '人大代表', '人弹', '人民大会堂', '人民日报', '人体炸弹', '日Gm', '日gm', '日本RING', '日你', '日你娘', '肉棒', '肉洞', '肉棍', '肉穴', '乳波臀浪', '乳交', '撒尿', '塞白', '塞你公', '塞你老师', '塞你娘', '三个代婊', '三民主义', '三陪女', '三唑仑', '骚B', '骚货', '色情', '色情服务', '杀人犯', '傻屄', '傻比', '傻卵', '煞逼', '上妳', '社科院', '身份生成器', '神通加持法', '圣女峰', '十年动乱石进', '食屎', '驶你公', '驶你老师', '驶你娘', '手淫', '售ID', '售软件', '氵去', '水去车仑', '司法部', '私/服', '私\\\\服', '私-服', '私—服', '死gd', '死gm', '死全家', '四人帮', '宋祖英', '孙逸仙', '他爹', '他妈的', '他母亲', '台办', '台联', '台湾帝国', '台湾共产党', '台湾狗', '台湾民国', '太子党', '天皇陛下', '舔西', '透视软件', '外\u3000挂', '外/挂', '外\\\\挂', '外_挂', '外-挂', '外汇局', '外专局', '万税', '王宝森', '王昊', '王岐山', '王兆国', '网管', '威而柔', '尉健行', '温家宝', '温馨', '文化部', '倭国', '我操', '我干', '我日', '无界浏览器', '吴邦国', '吴仪', '西藏独立', '希拉克', '希望之声', '系统', '系统讯息', '乡巴佬', '小鸡鸡', '小泉纯一郎', '小肉粒', '小穴', '新疆独立', '性爱', '性虐待', '性欲', '学潮', '血腥图片', '鸦片液', '烟草局', '阳精', '摇头丸', '耶和华', '耶稣', '夜情', '一贯道', '一夜情', '伊拉克', '伊斯兰', '抑制剂', '阴唇', '阴蒂', '阴户', '阴毛', '阴小撕大', '淫荡', '淫货', '淫叫', '淫靡', '淫娃', '淫欲', '硬挺', '游戏发奖员', '游戏管理员', '俞正声', '玉杵', '原子能机构', '远程偷拍', '曰Gm', '曰gm', '月经', '月经', '杂种', '曾培炎', '扎卡维', '张潮阳', '张磊', '张小平', '侦探设备', '中国恐怖组织', '中南海', '周恩来', '周总理', '朱容鸡', '朱熔基', '朱总理', '猪容基', '转法轮', '装屄', '追查国际', '自焚', '自杀指南', '自治机关', '总局', '作爱', '做爱', '江泽民', '温家宝', '屄毛', '东突', '法轮功', '胡锦涛', 'urban-rivals', 'u r', '我日', 'ur', '口交', 'taobao', '婊子', '他妈', '牛逼', '牛B', '傻逼', '你妈', '装逼', '日你妈', '删号', '垃圾游戏', '删 号', '妈逼', 'T.M.D', 'jb', '出售账号', '卖号', 'U-R', 'j8', '8仙', '出售神符', '黄色', '龙虎', '龙 虎 门', 'WEB战牌', '8 仙', 'ur', '街头对抗', '台独', '混 沌决', 'UR', '鸡巴', '作爱', '宗教', '自制手枪', '額爾德尼', '西藏3.14事件', '新疆獨立', '西藏獨立', '藏青會', '藏婦會', '疆獨', '藏獨', '東突', '新疆國', '西藏國', '熱比娅', '骚乱', '分裂', '拉萨', '新疆凶徒', 'xinjiang 12', '新疆暴徒', '新疆事件', '乌鲁木齐4.30事件', '乌鲁木齐5.22事件', '新疆出事', 'Gyallu', '被遗忘的雪域之歌', '度母化声', '密勒日巴道歌', '修行的女人', '花开时节', '葛莎雀吉', '西藏寺庙', '西藏喇嘛庙', '迷情药', '迷情水', '迷情粉', '臊冰', '开心水', '羟亚胺', '盐酸伪麻黄碱', '麻果', '麻古', '麻姑', '植物冰', '塑料冰', '神仙水', '喵喵药', '海乐神', '黄绿牙签', '黄白牙签', '黄白牙簽', '氯胺酮', '麦角胺', '美沙酮', '迷幻水', '迷幻藥', 'ghb', 'g水', 'king粉', 'HIGH水', '钻石冰糖', 'happy水', '快樂丸', '长治筋', '蒙汗药', '苍蝇水', '甲基苯丙胺', '致幻剂', '安钠咖', '左旋麻黄素', '神仙糖', '昏迷粉', '迷魂水', '强暴药', '云南情蛊', '尼美西泮', '安纳咖', '安眠酮', '冰古', '催情粉', '催情水', '崔情水', '吹情水', '失身', '失身水', 'lsd', '钻石冰毒', '摇头糖', '搖頭糖', '曲马多', '哌替啶', '春藥', '乙醚三唑', '失忆水', '酣乐欣', '土冰', '毒品', '冰du', '溜冰壶', '溜冰妹', '水晶冰', '冰 毒', '黄牙签', '黃牙簽', '纯冰黄冰', '黄冰', '黄冰白冰', '麥角酸', '鹽酸羥亞胺', '三唑侖', '强暴', '强暴幼女', '强暴电影', '伦理三级', '偷听器', '裸聊', '躶聊', 'luo聊', '深喉口爆', '颜射口爆', '强女干', 'h片', '膣', '舔下体', '口活', '爆菊', '人體炸彈', '出售假钞', '习仲勋', '彭丽媛', '习明泽', '上访', '人肉', '监听王', '手机复制', '透视眼镜', '身份证生成器', '活摘器', '雪山狮子旗', '拉萨骚乱', '退党团队', '中共暴政', '在线博彩', '胡錦濤', '習近平', '刘奇葆', '劉奇葆', '代开发票', '偷窥', '偷窥视频', '全能神', '全能神教', '李肇星务', '国务院', '发改委', '发展和改革委员会', '发展与改革委员会', '尖阁列岛', '东方闪电', '呼喊派', '观音法门', '被立王', '达米宣教会', '常受教', '主神教', '徒弟会', '同一教', 'ISIL', '乌克兰分离', '大纪元新闻网', '一中一台', '洗脑班', '正悟网', '正清网', '正见网', '升达毕业证', '生春袋', ' a$$hole', 'a$shole', 'Admin', 'as$hole', 'ASS', 'asshole', 'bastard', 'bbscity', 'beijingspring', 'bignews', 'bitch Bitch', 'bjzc', 'boxun'
];

var filterWord = new GameClient.FilterWord(sensitive_words);

// cc.log("1: " + filterWord.RunFilterWord("asdfsdsddaadaaabbbffdassdf sdf bbb aaa a", "#", 1));