var table_room_params = {

    1009:{
        'game_mode'   : {
            0 : '叫分',
            1 : '抢庄'
        },
        'game_round' : {
            1 : '1局',
            4 : '4局',
            8 : '8局',
            12 : '12局',
            16 : '16局',
        },
        'max_boom_times' : {
            3 : '炸弹上限3',
            4 : '炸弹上限4',
            5 : '炸弹上限5',
            9999 : '无上限',
            999999 : '无上限',
        },
        'pay_mode'   : {
            1 : '房主支付',
            2 : 'AA支付',
            3 : '房主支付',
        },
        // 'flower_mode'   : {
        //     0 : '无花牌',
        //     1 : '有花牌'
        // },
        'mul_mode'   : {
            0 : '',
            1 : '加倍'
        },
		'dealer_joker'   : {
			0 : '',
			1 : '双王必叫'
		},
		'dealer_42'   : {
			0 : '',
			1 : '四个二必叫'
		},
        'mul_score'    : {
            1 : '1倍',
            2 : '2倍',
            3 : '3倍',
            4 : '4倍',
            5 : '5倍',
        },
        'only3_1'   : {
            0 : '非三张只能带一',
            1 : '三张只能带一'
        },
		'is_emotion'   : {
			0 : '',
			1 : '禁用表情'
		},
    },
    1012:{
        'game_mode'   : {
            0 : '普通玩法',
            1 : '特殊牌型'
        },
        'game_round' : {
            1 : '1局',
            4 : '4局',
            8 : '8局',
            12 : '12局',
            16 : '16局',
        },
        'add_winds' : {
            0 : '',
            1 : '带风'
        },
        'add_dealer'   : {
            0 : '',
            1 : '带庄',
        },
        'kong_follow_win'   : {
            0 : '',
            1 : '杠随胡',
        },
        'need_ting'   : {
            0 : '',
            1 : '报听'
        },
        // 'bao_hu'   : {
        //     0 : '',
        //     1 : '包胡'
        // },
        'multiplayer_win'   : {
            0 : '',
            1 : '一炮多响'
        },
        'king_mode'   : {
            0 : '',
            1 : '带耗子'
        },
        'lack_door'   : {
            0 : '',
            1 : '缺一门'
        },
        'pay_mode'   : {
            1 : '房主支付',
            2 : 'AA支付',
            3 : '房主支付',
        },
    },
    1004:{
        'game_mode'   : {
            0 : '普通玩法',
            1 : '特殊牌型',
            2 : '耗子玩法',
        },
        'game_round' : {
            1 : '1局',
            4 : '4局',
            8 : '8局',
            12 : '12局',
            16 : '16局',
        },
        'king_mode' : {
            99: '',
            0 : '风耗子',
            1 : '单耗子',
        },
        'add_dealer' : {
            0 : '',
            1 : '加庄',
        },
        'reward' : {
            99: '',
            0 : '',
            1 : '赏金',
        },
	    'ekong_is_dwin' : {
		    99: '',
		    0 : '',
		    1 : '明杠杠开算自摸',
	    },
	    'bao_kong' : {
		    99: '',
		    0 : '',
		    1 : '点杠不包杠',
	    },
	    'repeat_kong' : {
		    99: '',
		    0 : '',
		    1 : '回手杠',
	    },
	    'special_mul' : {
		    99: '',
		    0 : '',
		    1 : '特殊牌型翻倍',
	    },
	    'seven_pair' : {
		    99: '',
		    0 : '',
		    1 : '七小对',
	    },
	    'mouse_general' : {
		    99: '',
		    0 : '',
		    1 : '耗子吊将',
	    },
	    'mouse_general_onetwo' : {
		    99: '',
		    0 : '',
		    1 : '耗子吊将1、2能胡',
	    },
	    'ting_mouse' : {
		    99: '',
		    0 : '',
		    1 : '可以单听耗子',
	    },
        'pay_mode'   : {
            1 : '房主支付',
            2 : 'AA支付',
            3 : '房主支付',
        },
    },
    1005:{
        'same_suit_mode'   : {
            0 : '',
            1 : '清一色'
        },
        // 'same_suit_loong'   : {
        //     0 : '',
        //     1 : '青龙'
        // },
        'game_round' : {
            1 : '1局',
            4 : '4局',
            8 : '8局',
            12 : '12局',
            16 : '16局',
        },
        'pay_mode'   : {
            1 : '房主支付',
            2 : 'AA支付',
            3 : '房主支付',
        }
    },
    1011:{
        'suit_mode'   : {
            0 : '',
            2 : '7对',
        },
        'game_round' : {
            1 : '1局',
            4 : '4局',
            8 : '8局',
            12 : '12局',
            16 : '16局',
        },
        'king_num' : {
            0 : '',
            1 : '带混',
        },
        'win_mode' : {
            0 : '',
            1 : '硬八张',
        },
        'add_dealer' : {
            0 : '',
            1 : '连庄',
        },
        'base_score' : {
            0 : '',
            1 : '带庄',
        },
        'pay_mode'   : {
            1 : '房主支付',
            2 : 'AA支付',
            3 : '房主支付',
        },
        'job_mode'   : {
            0 : '',
            1 : '包胡'
        }
    },
    1013:{
        'game_round' : {
            1 : '1局',
            4 : '4局',
            8 : '8局',
            12 : '12局',
            16 : '16局',
        },
        'base_score'   : {
            1 : '倍数1倍',
            2 : '倍数2倍',
            3 : '倍数3倍',
            4 : '倍数4倍',
            5 : '倍数5倍',
            10 : '倍数10倍',
            20 : '倍数20倍',
            50 : '倍数50倍',
        },
        'stand_four' : {
            0 : '',
            1 : '立四玩法',
        },
        'pay_mode'   : {
            1 : '房主支付',
            2 : 'AA支付',
            3 : '房主支付',
        }
    },
    1014:{
        'game_round' : {
            1 : '1局',
            4 : '4局',
            8 : '8局',
            12 : '12局',
            16 : '16局',
        },
        'base_score'   : {
            1 : '倍数1倍',
            2 : '倍数2倍',
            3 : '倍数3倍',
            4 : '倍数4倍',
            5 : '倍数5倍',
            10 : '倍数10倍',
            20 : '倍数20倍',
            50 : '倍数50倍',
        },
        'pay_mode'   : {
            1 : '房主支付',
            2 : 'AA支付',
            3 : '房主支付',
        }
    },

    1015:{
        'game_mode' :{
            0 : '放炮胡',
            1 : '自摸胡'
        },
        'score_mode' :{
            0 : '放炮三家出',
            1 : '放炮一家出'
        },
        'seven_pair':{
            0 : '非七对',
            1 : '七对'
        },
        'base_score' :{
            1 : '底分1分',
            2 : '底分2分',
            5 : '底分5分'
        },
        'kong_mode' :{
            0 : '杠不算分',
            1 : '杠算分'
        },
        'game_round' : {
            1 : '1局',
            4 : '4局',
            8 : '8局',
            12 : '12局',
            16 : '16局',
        },
        'pay_mode'   : {
            1 : '房主支付',
            2 : 'AA支付',
            3 : '房主支付',
        }
    },

	1016:{
		'game_mode'   : {
			0 : '普通玩法',
			1 : '特殊牌型',
			2 : '耗子玩法',
		},
		'game_round' : {
			1 : '1局',
			4 : '4局',
			8 : '8局',
			12 : '12局',
			16 : '16局',
		},
		'base_score' : {
			1 : '倍数1倍',
			2 : '倍数2倍',
			5 : '倍数5倍',
		},
		'king_mode' : {
			99: '',
			0 : '风耗子',
			1 : '单耗子',
			2 : '双耗子',
		},
		'add_dealer' : {
			0 : '',
			1 : '加庄',
		},
		'reward' : {
			99: '',
			0 : '',
			1 : '赏金',
		},
		'ekong_is_dwin' : {
			99: '',
			0 : '',
			1 : '明杠杠开算自摸',
		},
		'bao_kong' : {
			99: '',
			0 : '',
			1 : '点杠不包杠',
		},
		'repeat_kong' : {
			99: '',
			0 : '',
			1 : '回手杠',
		},
		'special_mul' : {
			99: '',
			0 : '',
			1 : '特殊牌型翻倍',
		},
		'seven_pair' : {
			99: '',
			0 : '',
			1 : '七小对',
		},
		'mouse_general' : {
			99: '',
			0 : '',
			1 : '耗子吊将',
		},
		'mouse_general_onetwo' : {
			99: '',
			0 : '',
			1 : '耗子吊将1、2能胡',
		},
		'ting_mouse' : {
			99: '',
			0 : '',
			1 : '可以单听耗子',
		},
		'pay_mode'   : {
			1 : '房主支付',
			2 : 'AA支付',
			3 : '房主支付',
		},
	},

    1017:{
        'game_round' : {
            1 : '1局',
            4 : '4局',
            6 : '6局',
            8 : '8局',
        },
        'mul_level'   : {
            1 : '倍数1倍',
            2 : '倍数2倍',
            5 : '倍数5倍',
        },
        'max_level'   : {
            3:'3级封顶',
            5:'5级封顶',
        },
        'play_mode' : {
            0 : '',
            1 : '扣底翻倍',
        },
        'sig_double' : {
            0 : '',
            1 : '单打翻倍',
        },
		'bottom_level' : {
			0 : '',
			1 : '抠底加级',
		},
        'pay_mode'   : {
            1 : '房主支付',
            2 : 'AA支付',
            3 : '房主支付',
        },
		'is_emotion'   : {
			0 : '',
			1 : '禁用表情'
		},
    },

    1018:{
        'game_round' : {
            1 : '1局',
            4 : '4局',
            8 : '8局',
            12 : '12局',
            16 : '16局',
        },
        'base_score'   : {
            1 : '倍数1倍',
            2 : '倍数2倍',
            3 : '倍数3倍',
            4 : '倍数4倍',
            5 : '倍数5倍',
        },
        'pay_mode'   : {
            1 : '房主支付',
            2 : 'AA支付',
            3 : '房主支付',
        },
    },

	1019:{
		'game_round' : {
			1 : '1局',
			4 : '4局',
			8 : '8局',
			12 : '12局',
			16 : '16局',
		},
		'base_score'   : {
			1 : '倍数1倍',
			2 : '倍数2倍',
			3 : '倍数3倍',
			4 : '倍数4倍',
			5 : '倍数5倍',
		},
		'pay_mode'   : {
			1 : '房主支付',
			2 : 'AA支付',
			3 : '房主支付',
		},
	},

	1023:{
		'game_mode'   : {
			1 : '特殊牌型',
			2 : '耗子玩法'
		},
		'game_round' : {
			4 : '4局',
			8 : '8局',
			12 : '12局',
			16 : '16局',
		},
		'add_dealer'   : {
			0 : '',
			1 : '带庄',
		},
		'need_ting'   : {
			0 : '',
			1 : '报听'
		},
		'guo_hu'   : {
		    0 : '',
		    1 : '过胡只能自摸'
		},
		'san_hua'   : {
			0 : '',
			1 : '三花不算杠'
		},
		'shisan_yao'   : {
			0 : '',
			1 : '十三幺'
		},
		'player_num'   : {
			2 : '2人',
			3 : '3人',
			4 : '4人'
		},
		'base_score'   : {
			1 : '倍数1倍',
			2 : '倍数2倍',
			5 : '倍数5倍',
		},
		'pay_mode'   : {
			1 : '房主支付',
			2 : 'AA支付',
			3 : '房主支付',
		},
	},
}
